app/controllers/accounts_controller.rb

  def show
    @account = Account.find(params[:id])
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 68354954)

  def edit
    @account = Account.find(params[:id])
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 68354954)

  def update
    @account = Account.find(params[:id])
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 68354954)

  def destroy
    @account = Account.find(params[:id])
    @account.destroy
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 68354954)
DELETE FROM "accounts" WHERE "id" = 68354954