app/controllers/contacts_controller.rb

SELECT * FROM `contacts` WHERE (`contacts`.`id` IN (1))
---
  def index
    @contacts = Contact.find(:all, :order => "#{params[:order_by]} #{params[:direction]}")