app/controllers/contacts_controller.rb

SELECT * FROM `contacts` ORDER BY account desc
---
  def index
#    @contacts = Contact.find(:all, :order => "#{params[:order_by]} #{params[:direction]}")
    @contacts = Contact.search params[:search]

SELECT * FROM `contacts` WHERE (`contacts`.`id` = 68354954)
---
  def show
    @contact = Contact.find(params[:id])

SELECT * FROM `contacts` WHERE (`contacts`.`id` = 68354954)
---
  def edit
    @contact = Contact.find(params[:id])

INSERT INTO `contacts` (`name`, `updated_at`, `account`, `phone`, `source`, `email`, `created_at`) VALUES('Bob', '2009-03-23 02:28:38', 'Wind', '555-555-5555', 'FTP', 'bob@wind.com', '2009-03-23 02:28:38')
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save

SELECT * FROM "contacts" WHERE ("contacts"."id" = 68354954)
---
  def update
    @contact = Contact.find(params[:id])

SELECT * FROM `contacts` WHERE (`contacts`.`id` = 68354954)
DELETE FROM `contacts` WHERE `id` = 68354954
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy