app/controllers/datafeeds_controller.rb

SELECT * FROM `datafeeds` WHERE (`datafeeds`.`id` = 68354954)
---
  def show
    @datafeed = Datafeed.find(params[:id])

SELECT * FROM `datafeeds` WHERE (`datafeeds`.`id` = 68354954)
---
  def edit
    @datafeed = Datafeed.find(params[:id])

SELECT * FROM "datafeeds" WHERE ("datafeeds"."id" = 68354954)
---
  def update
    @datafeed = Datafeed.find(params[:id])

SELECT * FROM `datafeeds` WHERE (`datafeeds`.`id` = 68354954)
DELETE FROM `datafeeds` WHERE `id` = 68354954
---
  def destroy
    @datafeed = Datafeed.find(params[:id])
    @datafeed.destroy