app/controllers/issues_controller.rb

SELECT * FROM `issues` WHERE (`issues`.`id` = 68354954)
---
  def show
    @issue = Issue.find(params[:id])

SELECT * FROM `issues` WHERE (`issues`.`id` = 68354954)
---
  def edit
    @issue = Issue.find(params[:id])

SELECT * FROM `issues` WHERE (`issues`.`id` = 68354954)
---
  def update
    @issue = Issue.find(params[:id])

SELECT * FROM `issues` WHERE (`issues`.`id` = 68354954)
DELETE FROM `issues` WHERE `id` = 68354954
---
  def destroy
    @issue = Issue.find(params[:id])
    @issue.destroy