app/controllers/sources_controller.rb

  def show
    @source = Source.find(params[:id])
---
SELECT * FROM `sources` WHERE (`sources`.`id` = 68354954)

  def edit
    @source = Source.find(params[:id])
---
SELECT * FROM `sources` WHERE (`sources`.`id` = 68354954)

  def create
    @source = Source.new(params[:source])

    respond_to do |format|
      if @source.save
---
INSERT INTO `sources` (`name`, `updated_at`, `account`, `datafeed`, `created_at`) VALUES('NOAA', '2009-03-23 05:14:15', 'RFC', 'precip', '2009-03-23 05:14:15')

  def update
    @source = Source.find(params[:id])
---
SELECT * FROM `sources` WHERE (`sources`.`id` = 68354954)

  def destroy
    @source = Source.find(params[:id])
    @source.destroy
---
SELECT * FROM `sources` WHERE (`sources`.`id` = 68354954)
DELETE FROM `sources` WHERE `id` = 68354954